snappy_pipe/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heheuPsiThermo;
    mixture         homogeneousMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          absoluteEnthalpy;
}

stoichiometricAirFuelMassRatio
    stoichiometricAirFuelMassRatio [0 0 0 0 0 0 0] 15.675;

reactants
{
    specie
    {
        molWeight       44.0962;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs
        (
            7.53414 0.0188722 -6.27185e-06 9.14756e-10 -4.78381e-14 -16467.5 -17.8923
        );
        lowCpCoeffs
        (
            0.933554 0.0264246 6.10597e-06 -2.19775e-08
            9.51493e-12 -13958.5 19.2017
        );
    }
    transport
    {
        mu              1e-5;
        Pr              1;

        As              1.67212e-06;
        Ts              170.672;
    }
}

products
{
    specie
    {
        molWeight       28.3233;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs
        (
            3.10561 0.00179748 -5.94701e-07 9.05612e-11
            -5.08447e-15 -11003.6 5.12109
        );
        lowCpCoeffs
        (
            3.498 0.000638554 -1.83885e-07 1.20991e-09
            -7.68702e-13 -11080.6 3.1819
        );
    }
    transport
    {
        mu              1e-5;
        Pr              1;

        As              1.67212e-06;
        Ts              170.672;
    }
}


// ************************************************************************* //
