snappy_pipe/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cylinder; 
        type    faceSet;
        action  new; 
        source  patchToFace; 
        sourceInfo
        {
          patch cylinder;
        }
    }
    // add patch to distract bottom patch
    {
        name    bottom_patch_negative;
        type    faceSet;
        action  new; 
        source  boxToFace;
        sourceInfo
        {
          //box (x0 y0 z0) (x1 y1 z1);
          box (-0.6 -0.6 0.01) (0.6 0.6 41);
        }
    }
    // add patch to distract top patch
    {
        name    top_patch_negative;
        type    faceSet;
        action  new; 
        source  boxToFace;
        sourceInfo
        {
          box (-0.6 -0.6 -1.0) (0.6 0.6 39.99);
        }
    }
    //new bottom face set
    {
        name    bottomPatch; 
        type    faceSet;
        action  new; 
        source  faceToFace; 
        sourceInfo
        {
          set cylinder;
        }
    }
    
    {
        name    bottomPatch; 
        type    faceSet;
        action  delete; 
        source  faceToFace; 
        sourceInfo
        {
          set bottom_patch_negative;
        }
    }

    //new top face set
    {
        name    topPatch; 
        type    faceSet;
        action  new; 
        source  faceToFace; 
        sourceInfo
        {
          set cylinder;
        }
    }
    
    {
        name    topPatch; 
        type    faceSet;
        action  delete; 
        source  faceToFace; 
        sourceInfo
        {
          set top_patch_negative;
        }
    }
    
    //new wall face set
    {
        name    wall; 
        type    faceSet;
        action  new; 
        source  faceToFace; 
        sourceInfo
        {
          set cylinder;
        }
    }
    
    {
        name    wall; 
        type    faceSet;
        action  delete; 
        source  faceToFace; 
        sourceInfo
        {
          set bottomPatch;
        }
    }
    
    {
        name    wall; 
        type    faceSet;
        action  delete; 
        source  faceToFace; 
        sourceInfo
        {
          set topPatch;
        }
    }
);

// ************************************************************************* //
